{
  "biomedZaklad": [
    "1. Buňka – organizace, buněčné organely, buněčné signalizace.",
    "2. Homeostáza a její udržování – příklady homeostatických parametrů, buněčná a tkáňová homeostáza.",
    "3. Regulace v živých systémech (biokybernetika).",
    "4. Adaptace – princip, evoluční smysl, příklady. Význam adaptací v rozvoji nemocí.",
    "5. Obecné principy energetického metabolismu – zdroje, přeměna a ukládání energie v živých systémech.",
    "6. Kardiovaskulární systém – přehled jednotlivých částí a jejich funkcí, nejčastější nemoci a mechanismy jejich vzniku.",
    "7. Respirační systém – přehled jednotlivých částí, funkce, nejčastější nemoci a mechanismy jejich vzniku.",
    "8. Trávicí a vylučovací systém – přehled jednotlivých částí, základní funkce, nejčastější nemoci a mechanismy jejich vzniku.",
    "9. Endokrinní systém – hypotalamo-hypofyzární systém a jeho role v řízení endokrinních funkcí, význam a regulace sekrece hormonů štítné žlázy, nadledvin a endokrinního pankreatu. Reprodukční systém muže a ženy – přehled jednotlivých částí a jejich funkcí, regulace reprodukčních funkcí člověka.",
    "10. Nervový systém – centrální vs. periferní, somatický vs. autonomní. Popis jednotlivých částí, přehled funkcí. Reflexy – typy, možnosti vyšetření.",
    "11. Základní smysly člověka – přehled a význam. Princip funkce jednotlivých smyslových orgánů.",
    "12. Akutní stavy u pacientů. Základní postupy první pomoci.",
    "13. Anamnéza a základní vyšetření pacienta (pohled, poslech, pohmat, poklep).",
    "14. Přehled laboratorních (klinická biochemie, hematologie) a pomocných vyšetřovacích metod v klinické praxi – příklady, indikace, případná rizika pro pacienty a personál.",
    "15. Experimentální práce s různými biomodely (buněčné a tkáňové modely, pokusná zvířata) - význam a příklady."
  ],
  "bioinformatika": [
    "16. Metody studia buněčných jevů – od molekulární po orgánovou úroveň.",
    "17. Principy dědičnosti, metody vyšetřování.",
    "18. Sekvence v genomice, exprese genetické informace, obsah a mutace v sekvencích.",
    "19. Základy sekvenace DNA a sekvenační platformy, zpracování sekvenačních dat a datové formáty pro práci se sekvencemi.",
    "20. Dynamické programování, algoritmy pro globální a lokální zarovnání, obsah a konstrukce substitučních matic.",
    "21. BLAST a vícenásobné zarovnávání.",
    "22. Fylogenetické stromy, typy stromů a principy jejich konstrukce.",
    "23. Numerické reprezentace genomických a proteomických dat a metody signálového zpracování.",
    "24. Struktury proteinů, laboratorní techniky pro jejich měření, metody predikce proteinových struktur.",
    "25. Mikroskopické techniky v biologii a medicíně – principy a využití.",
    "26. Metody testování buněčné viability a poškození. Radiační poškození buněk.",
    "27. Vznik, funkce a šíření akčního napětí u excitabilních buněk; Metody měření membránových proudů a membránových napětí.",
    "28. Membránové kanály a přenašeče; Vztah mezi proudy zaznamenávaných na molekulární úrovni (z jednoho kanálu) a z celé izolované buňky.",
    "29. Vazba mezi elektrickou excitací (akčním napětím) a kontrakcí svalové buňky.",
    "30. Membránové systémy, stavba a funkce buněčné membrány, elektrický model membrány.",
    "31. Principy statistického hodnocení dat – experimentální a klinické studie."
  ],
  "zpracovaniSignalu": [
    "1. Lineární a nelineární systémy, impulsní a frekvenční charakteristika, spektrum signálu, diskretizace a vzorkovací teorém, diskrétní lineární systémy a jejich charakteristiky, DFT",
    "2. Lineární filtrace – pásmová filtrace, FIR a IIR filtry, jejich vlastnosti a struktury, kumulace signálů",
    "3. Analýza signálů – auto – a vzájemná korelační analýza a její využití, spektrální analýza deterministických a stochastických signálů, výkonové spektrum",
    "4. Analogová a diskrétní reprezentace obrazů, základní 2D operátory, základní metody úpravy obrazů (zostřování a vyhlazování)",
    "5. Signály EKG a PPG a jejich vlastnosti, požadavky na zpracování EKG; Lineární a adaptivní filtry pro potlačení rušení; Principy detekce komplexů QRS",
    "6. Měření variability srdečního rytmu, její analýza v časové a ve frekvenční oblasti",
    "7. Signály EEG a jejich vlastnosti, test stacionarity; Detekce grafoelementů přizpůsobenými filtry; vzájemná a koherenční spektra, využití; Topografické mapování",
    "8. Akční potenciály motorických jednotek a povrchové signály EMG, jejich vlastnosti. Průběžný odhad úrovně povrchového EMG",
    "9. Odhady výkonových spekter – parametrické a neparametrické metody",
    "10. Návrh vícevrstvé umělé neuronové sítě. Základní princip učení a vybavování dopředné sítě. Klasifikační možnosti jedno – a vícevrstvých sítí, postupy pro zvýšení klasifikační úspěšnosti sítě (z hlediska použitých algoritmů a vstupních dat). Výhody a nevýhody využití umělých neuronových sítí v biomedicínských aplikacích.",
    "11. Algoritmy strojového učení: učení s učitelem a bez učitele. Význam a typy používaných kriteriálních funkci, hyperparametry algoritmů strojového učení. Generalizační schopnosti modelu, nedoučení/přeučení modelu. Faktory ovlivňující kvalitu výstupů učících se modelů. Metriky pro hodnocení úspěšnosti klasifikačních/regresních modelů, výhody/nevýhody jednotlivých metrik.",
    "12. Hierarchické shlukování dat vycházející z matice podobností, principy odvození dendrogramů. Nehierarchická metoda shlukování k-means. Faktory ovlivňující kvalitu výsledných shluků, hodnocení výsledků shlukování. Výhody a nevýhody hierarchických a nehierarchických metod shlukování. Předzpracování dat před shlukováním.",
    "13. Použití příznaků při klasifikaci objektů. Důvody redukce počtu příznaků. Selekce a extrakce příznaků: metoda hlavních komponent (PCA) a tzv. „filter“ a „wrapper“ metody. Výhody a nevýhody jednotlivých metod.",
    "14. Fuzzy čísla a fuzzy množiny, základní operace s nimi. Principy přibližného usuzování. Návrh fuzzy inferenčního systému (FIS), logické operace v FIS, faktory ovlivňující kvalitu výstupu FIS."
  ],
  "biomedTechnika": [
    "15. Elektrická stimulace svalů a orgánů, základní princip, parametry stimulačních proudů",
    "16. Ultrazvuková fyzikální terapie, základní princip, využití ultrazvuku v aerosologii.",
    "17. Vysokofrekvenční ohřev tkáně, základní princip, aplikace.",
    "18. Kryochirurgie, základní princip, technické řešení zařízení.",
    "19. Podpora funkce ledvin – hemodialýza, hemofiltrace, základní princip, technické řešení.",
    "20. Proces zobrazení a jeho specifikace, klasifikace zobrazovacích systémů, typy obrazů a formy jejich prezentace, hodnocení kvality procesu zobrazení.",
    "21. Termokamery – fyzikální principy teorie vyzařování, konstrukce termokamery, principy fotonových a tepelných detektorů, hodnocení kvality a klinické aplikace.",
    "22. RTG zobrazovací systémy – principy činnosti rentgenky, interakce záření s hmotou, detekce záření; CT RTG zobrazovací systémy – konstrukce systémů, rekonstrukce obrazu z projekcí, hodnocení kvality a klinické aplikace.",
    "23. MRI zobrazovací systémy – základní popis jevu magnetické rezonance, Blochovy rovnice, základní experimenty a pulzní sekvence, konstrukční řešení MR skeneru, hodnocení kvality a klinické aplikace.",
    "24. Zobrazovací systémy nukleární medicíny – planární gamagrafie, SPECT, PET a hybridní zobrazovací systémy – specifika jednotlivých systémů, detekce záření, používané radionuklidy, hodnocení kvality a klinické aplikace.",
    "25. Ultrazvukové zobrazovací systémy – princip využití ultrazvuku pro zobrazování, základní zobrazovací módy, konstrukční typy sond a jejich buzení, tvorba obrazu, hodnocení kvality a klinické aplikace.",
    "26. Zesilovače pro elektrické biosignály – základní parametry diferenčního a přístrojového zesilovače. Vliv přechodu elektroda-kůže na měřený elektrický potenciál.",
    "27. Přístrojová technika pro měření elektrických biopotenciálů (EKG, EMG, EEG) – vlastnosti, požadavky, bloková řešení přístrojů a specifických funkcí.",
    "28. Měření krevního tlaku – princip metod pro spojité a nespojité měření. Blokové schéma těchto přístrojů.",
    "29. Princip metod pro měření průtoku krve pomocí dilučních metod a měření rychlosti toku krve pomocí Dopplerova jevu.",
    "30. Pulzní oxymetrie – blokové schéma, princip měření a funkce přístroje, zdroje chyb."
  ]
}
